KennyAlbus/RGB_LED_Based-on-STM32/Peripheral/timer_drv.c
#include "stm32f10x.h"
#include "led_drv.h"


led_color_t color_sequence = RGB_LED_GREEN;
//static void (*p_print_info_timer_handler)(void);

//void Callback_timer_handler(void(*p_func0)(void))
//{
//  p_print_info_timer_handler = p_func0;
//}

void led_test(void)
{
	Rgb_Led_Turn(color_sequence,RGB_LED_ON);
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		static uint16_t cnt;
		cnt++;
		if(cnt >= 1000)
		{
			cnt = 0;
		  color_sequence++;
			if(color_sequence > RGB_LED_WHITE)
				color_sequence = RGB_LED_GREEN;
		}
		
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}

void Timer_Drv_Init(void)
{
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	
	TIM_InternalClockConfig(TIM2);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 100 - 1;
	TIM_TimeBaseInitStructure.TIM_Prescaler = 720 - 1;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);
	
	TIM_ClearFlag(TIM2, TIM_FLAG_Update);
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	TIM_Cmd(TIM2, ENABLE);
}
